; domain
(define (domain logistic_planning_2)
  (:requirements :strips :typing :conditional-effects)

  (:types
    location - object ; can contain workstations robots and boxes
    warehouse - location ; contains supplies
    workstation - object ; can get boxes and contain supplies
    robot - object ; can pick up boxes, fill them, unload them and move between locations
    carrier - location ; contains boxes if it has free spaces
    space - object ; determines how many spaces a carrier has
    box - object ; can contain supplies
    supply - object ; required by workstations
    valve - supply ; type of supply
    bolt - supply ; type of supply
    tool - supply ; type of supply
    )

  (:predicates
    ;; locations
    (connected ?l1 ?l2 - location) ; location ?l1 is connected to location ?l2
    ;; boxes
    (box_at_loc ?b - box ?l - location) ; box ?b is in the location ?l
    (box_empty ?b - box) ; box ?b is empty
    (box_full ?b - box) ; box ?b is full
    (supply_in_box ?s - supply ?b - box) ; supply ?s is in box ?b
    ;; robots
    (robot_at_loc ?r - robot ?l - location) ; robot ?r is at location ?l
    (robot_has_carrier ?r - robot ?c - carrier) ; robot ?r has carrier ?c
    ;; workstations
    (ws_at_loc ?w - workstation ?l - location) ; workstation ?w is at location ?l
    ;; (ws_contains ?w - workstation ?s - supply) ; workstation ?w contains supply ?s
    (has_valve ?w - workstation) ; workstation ?w has a valve
    (has_bolt ?w - workstation) ; workstation ?w has a bolt
    (has_tool ?w - workstation) ; workstation ?w has a tool 
    (supply_available ?s - supply) ; supply ?s is available
    ;; supplies
    (supply_at_loc ?s - supply ?l - location) ; supply ?s is at location ?l
    ;; carrier space
    (free ?c - carrier ?s - space) ; space ?s is not used carrier ?c
    (occupied ?c - carrier ?s - space) ; space ?s is used by carrier ?c
  )

  ;; moves a robot with its carrier to a new location
  (:action move_carrier
    :parameters (?r - robot ?c - carrier ?from ?to - location)
    :precondition (and
      (connected ?from ?to)
      (robot_at_loc ?r ?from)
      (robot_has_carrier ?r ?c)
    )
    :effect (and
      (not (robot_at_loc ?r ?from))
      (robot_at_loc ?r ?to)
    )
  )

  ;; loads the carrier of a robot with a box
  (:action load_carrier
    :parameters (?r - robot ?c - carrier ?b - box ?s - space ?l - location)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?l)
      (robot_has_carrier ?r ?c)
      (free ?c ?s)
    )
    :effect (and
      (not (box_at_loc ?b ?l))
      (box_at_loc ?b ?c)
      (not (free ?c ?s))
      (occupied ?c ?s)
    )
  )

  ;; unloads the carrier of a robot with a box
  (:action unload_carrier
    :parameters (?r - robot ?c - carrier ?b - box ?s - space ?l - location)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?c)
      (robot_has_carrier ?r ?c)
      (occupied ?c ?s)
    )
    :effect (and
      (box_at_loc ?b ?l)
      (not (box_at_loc ?b ?c))
      (free ?c ?s)
      (not (occupied ?c ?s))
    )
  )

  ;; loads an empty box with a supply
  (:action load_supply
    :parameters (?r - robot ?l - location ?b - box ?s - supply)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?l)
      (supply_at_loc ?s ?l)
      (box_empty ?b)
      (supply_available ?s)
    )
    :effect (and
      (supply_in_box ?s ?b)
      (not (box_empty ?b))
      (box_full ?b)
      (not (supply_at_loc ?s ?l))
    )
  )
  ;; unloads the content of a box to a given workstation (:action unload_supply
  (:action unload_valve
    :parameters (?r - robot ?b - box ?valve - valve ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?valve ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ;; (is_valve ?s)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?valve ?l)
      ;; (ws_contains ?w ?valve)
      (not (supply_in_box ?valve ?b))
      (not (supply_available ?valve))
      (has_valve ?w)
    )
  )

  (:action unload_bolt
    :parameters (?r - robot ?b - box ?bolt - bolt ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?bolt ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ;; (is_bolt ?bolt)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?bolt ?l)
      ;; (ws_contains ?w ?bolt)
      (not (supply_in_box ?bolt ?b))
      (not (supply_available ?bolt))
      (has_bolt ?w)
    )
  )
  (:action unload_tool
    :parameters (?r - robot ?b - box ?tool - tool ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?tool ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ; (is_tool ?tool)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?tool ?l)
      ;; (ws_contains ?w ?tool)
      (not (supply_in_box ?tool ?b))
      (not (supply_available ?tool))
      (has_tool ?w)
    )
  )
  ; ;; unloads the content of a box to a given workstation
  ; (:action unload_supply
  ;   :parameters (?r - robot ?b - box ?s - supply ?l - location ?w - workstation)
  ;   :precondition (and 
  ;     (robot_at_loc ?r ?l) 
  ;     (supply_in_box ?s ?b) 
  ;     (box_at_loc ?b ?l) 
  ;     (ws_at_loc ?w ?l) 
  ;     (box_full ?b)
  ;   )
  ;   :effect (and 
  ;     (box_empty ?b) 
  ;     (not (box_full ?b))
  ;     (supply_at_loc ?s ?l) 
  ;     (ws_contains_supply ?w ?s) 
  ;     (not (supply_in_box ?s ?b)) 
  ;     (not (supply_available ?s))
  ;     (when
  ;       (is_valve ?s)
  ;       (has_valve ?w))
  ;     (when
  ;       (is_bolt ?s)
  ;       (has_bolt ?w))
  ;     (when
  ;       (is_tool ?s)
  ;       (has_tool ?w))
  ;   )
  ; )
)

; problem
(define (problem problem2_3)
  (:domain logistic_planning_2)

  (:objects
    robot1 robot2 - robot
    warehouse_loc location1 location2 location3 location4 location5 - location
    workstation1 workstation2 workstation3 workstation4 workstation5 workstation6 - workstation
    box1 box2 box3 - box
    valve1 valve2 valve3 valve4 valve5 valve6 - valve
    bolt1 bolt2 bolt3 bolt4 - bolt
    tool1 tool2 tool3 tool4 - tool
    carrier1 carrier2 - carrier
    s1 s2 s3 s4 - space
  )

  (:init
    ;; graph edges
    (connected warehouse_loc location1)
    (connected warehouse_loc location2)
    (connected warehouse_loc location5)
    (connected location1 warehouse_loc)
    (connected location1 location2)
    (connected location2 warehouse_loc)
    (connected location2 location1)
    (connected location2 location3)
    (connected location3 location2)
    (connected location3 location4)
    (connected location4 location3)
    (connected location4 location4)
    (connected location5 warehouse_loc)
    (connected location5 location4)
    ;; workstations location
    (ws_at_loc workstation1 location1)
    (ws_at_loc workstation2 location1)
    (ws_at_loc workstation3 location2)
    (ws_at_loc workstation4 location3)
    (ws_at_loc workstation5 location4)
    (ws_at_loc workstation6 location5)
    ;; box location
    (box_at_loc box1 warehouse_loc)
    (box_at_loc box2 warehouse_loc)
    (box_at_loc box3 warehouse_loc)
    ;; box empty
    (box_empty box1)
    (box_empty box2)
    (box_empty box3)
    ;; robot location
    (robot_at_loc robot1 warehouse_loc)
    (robot_at_loc robot2 warehouse_loc)
    ;; carrier owner
    (robot_has_carrier robot1 carrier1)
    (robot_has_carrier robot2 carrier2)
    ;; carrier space
    (free carrier1 s1)
    (free carrier1 s2)
    (free carrier1 s3)
    (free carrier2 s4)
    ;; supplies location
    (supply_at_loc valve1 warehouse_loc)
    (supply_at_loc valve2 warehouse_loc)
    (supply_at_loc valve3 warehouse_loc)
    (supply_at_loc valve4 warehouse_loc)
    (supply_at_loc valve5 warehouse_loc)
    (supply_at_loc valve6 warehouse_loc)
    (supply_at_loc bolt1 warehouse_loc)
    (supply_at_loc bolt2 warehouse_loc)
    (supply_at_loc bolt3 warehouse_loc)
    (supply_at_loc bolt4 warehouse_loc)
    (supply_at_loc tool1 warehouse_loc)
    (supply_at_loc tool2 warehouse_loc)
    (supply_at_loc tool3 warehouse_loc)
    (supply_at_loc tool4 warehouse_loc)
    ;; supplies availabity
    (supply_available valve1)
    (supply_available valve2)
    (supply_available valve3)
    (supply_available valve4)
    (supply_available valve5)
    (supply_available valve6)
    (supply_available bolt1)
    (supply_available bolt2)
    (supply_available bolt3)
    (supply_available bolt4)
    (supply_available tool1)
    (supply_available tool2)
    (supply_available tool3)
    (supply_available tool4)
  )

  (:goal
    (and
      ;; robot final location
      (robot_at_loc robot1 warehouse_loc)
      (robot_at_loc robot2 warehouse_loc)
      ;; valves
      (has_valve workstation1)
      (has_valve workstation2)
      (has_valve workstation3)
      (has_valve workstation5)
      (has_valve workstation6)
      ;; bolts
      (has_bolt workstation2)
      (has_bolt workstation3)
      (has_bolt workstation4)
      ;; tools
      (has_tool workstation1)
      (has_tool workstation3)
      (has_tool workstation6)
    )
  )
)

; plan
1. (move_carrier robot1 carrier1 warehouse_loc location1)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location1)
   goals met: 1 of 13
2. (load_supply robot2 warehouse_loc box3 bolt4)
   deleted: (box_empty box3) (supply_at_loc bolt4 warehouse_loc)
   added: (supply_in_box bolt4 box3) (box_full box3)
   goals met: 1 of 13
3. (load_carrier robot2 carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 1 of 13
4. (load_supply robot2 warehouse_loc box2 bolt3)
   deleted: (box_empty box2) (supply_at_loc bolt3 warehouse_loc)
   added: (supply_in_box bolt3 box2) (box_full box2)
   goals met: 1 of 13
5. (load_supply robot2 warehouse_loc box1 bolt2)
   deleted: (box_empty box1) (supply_at_loc bolt2 warehouse_loc)
   added: (supply_in_box bolt2 box1) (box_full box1)
   goals met: 1 of 13
6. (move_carrier robot2 carrier2 warehouse_loc location2)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location2)
   goals met: 0 of 13
7. (move_carrier robot2 carrier2 location2 location3)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 location3)
   goals met: 0 of 13
8. (unload_carrier robot2 carrier2 box3 s4 location3)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 location3) (free carrier2 s4)
   goals met: 0 of 13
9. (move_carrier robot2 carrier2 location3 location2)
   deleted: (robot_at_loc robot2 location3)
   added: (robot_at_loc robot2 location2)
   goals met: 0 of 13
10. (move_carrier robot2 carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 1 of 13
11. (load_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 1 of 13
12. (move_carrier robot2 carrier2 warehouse_loc location2)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location2)
   goals met: 0 of 13
13. (unload_carrier robot2 carrier2 box2 s4 location2)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location2) (free carrier2 s4)
   goals met: 0 of 13
14. (unload_bolt robot2 box2 bolt3 location2 workstation3)
   deleted: (box_full box2) (supply_in_box bolt3 box2) (supply_available bolt3)
   added: (box_empty box2) (supply_at_loc bolt3 location2) (has_bolt workstation3)
   goals met: 1 of 13
15. (move_carrier robot2 carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 2 of 13
16. (load_carrier robot2 carrier2 box1 s4 warehouse_loc)
   deleted: (box_at_loc box1 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   goals met: 2 of 13
17. (move_carrier robot1 carrier1 location1 warehouse_loc)
   deleted: (robot_at_loc robot1 location1)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 3 of 13
18. (move_carrier robot1 carrier1 warehouse_loc location5)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location5)
   goals met: 2 of 13
19. (move_carrier robot2 carrier2 warehouse_loc location1)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location1)
   goals met: 1 of 13
20. (unload_carrier robot2 carrier2 box1 s4 location1)
   deleted: (box_at_loc box1 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box1 location1) (free carrier2 s4)
   goals met: 1 of 13
21. (unload_bolt robot2 box1 bolt2 location1 workstation2)
   deleted: (box_full box1) (supply_in_box bolt2 box1) (supply_available bolt2)
   added: (box_empty box1) (supply_at_loc bolt2 location1) (has_bolt workstation2)
   goals met: 2 of 13
22. (move_carrier robot2 carrier2 location1 location2)
   deleted: (robot_at_loc robot2 location1)
   added: (robot_at_loc robot2 location2)
   goals met: 2 of 13
23. (move_carrier robot1 carrier1 location5 warehouse_loc)
   deleted: (robot_at_loc robot1 location5)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 3 of 13
24. (load_carrier robot2 carrier2 box2 s4 location2)
   deleted: (box_at_loc box2 location2) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 3 of 13
25. (move_carrier robot2 carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 4 of 13
26. (move_carrier robot1 carrier1 warehouse_loc location2)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location2)
   goals met: 3 of 13
27. (unload_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 3 of 13
28. (load_supply robot2 warehouse_loc box2 valve6)
   deleted: (box_empty box2) (supply_at_loc valve6 warehouse_loc)
   added: (supply_in_box valve6 box2) (box_full box2)
   goals met: 3 of 13
29. (load_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 3 of 13
30. (move_carrier robot1 carrier1 location2 warehouse_loc)
   deleted: (robot_at_loc robot1 location2)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 4 of 13
31. (move_carrier robot2 carrier2 warehouse_loc location2)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location2)
   goals met: 3 of 13
32. (unload_carrier robot2 carrier2 box2 s4 location2)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location2) (free carrier2 s4)
   goals met: 3 of 13
33. (unload_valve robot2 box2 valve6 location2 workstation3)
   deleted: (box_full box2) (supply_in_box valve6 box2) (supply_available valve6)
   added: (box_empty box2) (supply_at_loc valve6 location2) (has_valve workstation3)
   goals met: 4 of 13
34. (load_carrier robot2 carrier2 box2 s4 location2)
   deleted: (box_at_loc box2 location2) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 4 of 13
35. (move_carrier robot2 carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 5 of 13
36. (move_carrier robot1 carrier1 warehouse_loc location2)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location2)
   goals met: 4 of 13
37. (unload_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 4 of 13
38. (load_supply robot2 warehouse_loc box2 valve5)
   deleted: (box_empty box2) (supply_at_loc valve5 warehouse_loc)
   added: (supply_in_box valve5 box2) (box_full box2)
   goals met: 4 of 13
39. (load_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 4 of 13
40. (move_carrier robot2 carrier2 warehouse_loc location5)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location5)
   goals met: 3 of 13
41. (move_carrier robot1 carrier1 location2 location3)
   deleted: (robot_at_loc robot1 location2)
   added: (robot_at_loc robot1 location3)
   goals met: 3 of 13
42. (unload_bolt robot1 box3 bolt4 location3 workstation4)
   deleted: (box_full box3) (supply_in_box bolt4 box3) (supply_available bolt4)
   added: (box_empty box3) (supply_at_loc bolt4 location3) (has_bolt workstation4)
   goals met: 4 of 13
43. (unload_carrier robot2 carrier2 box2 s4 location5)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location5) (free carrier2 s4)
   goals met: 4 of 13
44. (move_carrier robot1 carrier1 location3 location2)
   deleted: (robot_at_loc robot1 location3)
   added: (robot_at_loc robot1 location2)
   goals met: 4 of 13
45. (unload_valve robot2 box2 valve5 location5 workstation6)
   deleted: (box_full box2) (supply_in_box valve5 box2) (supply_available valve5)
   added: (box_empty box2) (supply_at_loc valve5 location5) (has_valve workstation6)
   goals met: 5 of 13
46. (load_carrier robot2 carrier2 box2 s4 location5)
   deleted: (box_at_loc box2 location5) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 5 of 13
47. (move_carrier robot2 carrier2 location5 warehouse_loc)
   deleted: (robot_at_loc robot2 location5)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 6 of 13
48. (unload_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 6 of 13
49. (load_supply robot2 warehouse_loc box2 tool4)
   deleted: (box_empty box2) (supply_at_loc tool4 warehouse_loc)
   added: (supply_in_box tool4 box2) (box_full box2)
   goals met: 6 of 13
50. (load_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 6 of 13
51. (move_carrier robot2 carrier2 warehouse_loc location5)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location5)
   goals met: 5 of 13
52. (unload_carrier robot2 carrier2 box2 s4 location5)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location5) (free carrier2 s4)
   goals met: 5 of 13
53. (unload_tool robot2 box2 tool4 location5 workstation6)
   deleted: (box_full box2) (supply_in_box tool4 box2) (supply_available tool4)
   added: (box_empty box2) (supply_at_loc tool4 location5) (has_tool workstation6)
   goals met: 6 of 13
54. (load_carrier robot2 carrier2 box2 s4 location5)
   deleted: (box_at_loc box2 location5) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 6 of 13
55. (move_carrier robot2 carrier2 location5 warehouse_loc)
   deleted: (robot_at_loc robot2 location5)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 7 of 13
56. (unload_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 7 of 13
57. (load_supply robot2 warehouse_loc box2 tool3)
   deleted: (box_empty box2) (supply_at_loc tool3 warehouse_loc)
   added: (supply_in_box tool3 box2) (box_full box2)
   goals met: 7 of 13
58. (load_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 7 of 13
59. (move_carrier robot1 carrier1 location2 warehouse_loc)
   deleted: (robot_at_loc robot1 location2)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 8 of 13
60. (move_carrier robot2 carrier2 warehouse_loc location2)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location2)
   goals met: 7 of 13
61. (unload_carrier robot2 carrier2 box2 s4 location2)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location2) (free carrier2 s4)
   goals met: 7 of 13
62. (unload_tool robot2 box2 tool3 location2 workstation3)
   deleted: (box_full box2) (supply_in_box tool3 box2) (supply_available tool3)
   added: (box_empty box2) (supply_at_loc tool3 location2) (has_tool workstation3)
   goals met: 8 of 13
63. (load_carrier robot2 carrier2 box2 s4 location2)
   deleted: (box_at_loc box2 location2) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 8 of 13
64. (move_carrier robot2 carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 9 of 13
65. (move_carrier robot1 carrier1 warehouse_loc location2)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location2)
   goals met: 8 of 13
66. (unload_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   goals met: 8 of 13
67. (load_supply robot2 warehouse_loc box2 valve4)
   deleted: (box_empty box2) (supply_at_loc valve4 warehouse_loc)
   added: (supply_in_box valve4 box2) (box_full box2)
   goals met: 8 of 13
68. (load_carrier robot2 carrier2 box2 s4 warehouse_loc)
   deleted: (box_at_loc box2 warehouse_loc) (free carrier2 s4)
   added: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   goals met: 8 of 13
69. (move_carrier robot1 carrier1 location2 warehouse_loc)
   deleted: (robot_at_loc robot1 location2)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 9 of 13
70. (move_carrier robot2 carrier2 warehouse_loc location5)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location5)
   goals met: 8 of 13
71. (move_carrier robot1 carrier1 warehouse_loc location1)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location1)
   goals met: 7 of 13
72. (load_carrier robot1 carrier1 box1 s3 location1)
   deleted: (box_at_loc box1 location1) (free carrier1 s3)
   added: (box_at_loc box1 carrier1) (occupied carrier1 s3)
   goals met: 7 of 13
73. (move_carrier robot1 carrier1 location1 warehouse_loc)
   deleted: (robot_at_loc robot1 location1)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 8 of 13
74. (unload_carrier robot1 carrier1 box1 s3 warehouse_loc)
   deleted: (box_at_loc box1 carrier1) (occupied carrier1 s3)
   added: (box_at_loc box1 warehouse_loc) (free carrier1 s3)
   goals met: 8 of 13
75. (load_supply robot1 warehouse_loc box1 tool2)
   deleted: (box_empty box1) (supply_at_loc tool2 warehouse_loc)
   added: (supply_in_box tool2 box1) (box_full box1)
   goals met: 8 of 13
76. (load_carrier robot1 carrier1 box1 s2 warehouse_loc)
   deleted: (box_at_loc box1 warehouse_loc) (free carrier1 s2)
   added: (box_at_loc box1 carrier1) (occupied carrier1 s2)
   goals met: 8 of 13
77. (move_carrier robot1 carrier1 warehouse_loc location1)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location1)
   goals met: 7 of 13
78. (unload_carrier robot1 carrier1 box1 s2 location1)
   deleted: (box_at_loc box1 carrier1) (occupied carrier1 s2)
   added: (box_at_loc box1 location1) (free carrier1 s2)
   goals met: 7 of 13
79. (unload_tool robot1 box1 tool2 location1 workstation1)
   deleted: (box_full box1) (supply_in_box tool2 box1) (supply_available tool2)
   added: (box_empty box1) (supply_at_loc tool2 location1) (has_tool workstation1)
   goals met: 8 of 13
80. (move_carrier robot2 carrier2 location5 warehouse_loc)
   deleted: (robot_at_loc robot2 location5)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 9 of 13
81. (load_carrier robot1 carrier1 box1 s3 location1)
   deleted: (box_at_loc box1 location1) (free carrier1 s3)
   added: (box_at_loc box1 carrier1) (occupied carrier1 s3)
   goals met: 9 of 13
82. (move_carrier robot1 carrier1 location1 warehouse_loc)
   deleted: (robot_at_loc robot1 location1)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 10 of 13
83. (unload_carrier robot1 carrier1 box1 s3 warehouse_loc)
   deleted: (box_at_loc box1 carrier1) (occupied carrier1 s3)
   added: (box_at_loc box1 warehouse_loc) (free carrier1 s3)
   goals met: 10 of 13
84. (load_supply robot2 warehouse_loc box1 valve3)
   deleted: (box_empty box1) (supply_at_loc valve3 warehouse_loc)
   added: (supply_in_box valve3 box1) (box_full box1)
   goals met: 10 of 13
85. (load_carrier robot1 carrier1 box1 s2 warehouse_loc)
   deleted: (box_at_loc box1 warehouse_loc) (free carrier1 s2)
   added: (box_at_loc box1 carrier1) (occupied carrier1 s2)
   goals met: 10 of 13
86. (move_carrier robot1 carrier1 warehouse_loc location1)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location1)
   goals met: 9 of 13
87. (unload_carrier robot1 carrier1 box1 s2 location1)
   deleted: (box_at_loc box1 carrier1) (occupied carrier1 s2)
   added: (box_at_loc box1 location1) (free carrier1 s2)
   goals met: 9 of 13
88. (move_carrier robot2 carrier2 warehouse_loc location5)
   deleted: (robot_at_loc robot2 warehouse_loc)
   added: (robot_at_loc robot2 location5)
   goals met: 8 of 13
89. (move_carrier robot2 carrier2 location5 location4)
   deleted: (robot_at_loc robot2 location5)
   added: (robot_at_loc robot2 location4)
   goals met: 8 of 13
90. (unload_carrier robot2 carrier2 box2 s4 location4)
   deleted: (box_at_loc box2 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box2 location4) (free carrier2 s4)
   goals met: 8 of 13
91. (unload_valve robot2 box2 valve4 location4 workstation5)
   deleted: (box_full box2) (supply_in_box valve4 box2) (supply_available valve4)
   added: (box_empty box2) (supply_at_loc valve4 location4) (has_valve workstation5)
   goals met: 9 of 13
92. (move_carrier robot2 carrier2 location4 location3)
   deleted: (robot_at_loc robot2 location4)
   added: (robot_at_loc robot2 location3)
   goals met: 9 of 13
93. (load_carrier robot2 carrier2 box3 s4 location3)
   deleted: (box_at_loc box3 location3) (free carrier2 s4)
   added: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   goals met: 9 of 13
94. (move_carrier robot2 carrier2 location3 location2)
   deleted: (robot_at_loc robot2 location3)
   added: (robot_at_loc robot2 location2)
   goals met: 9 of 13
95. (move_carrier robot2 carrier2 location2 warehouse_loc)
   deleted: (robot_at_loc robot2 location2)
   added: (robot_at_loc robot2 warehouse_loc)
   goals met: 10 of 13
96. (move_carrier robot1 carrier1 location1 warehouse_loc)
   deleted: (robot_at_loc robot1 location1)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 11 of 13
97. (unload_carrier robot2 carrier2 box3 s4 warehouse_loc)
   deleted: (box_at_loc box3 carrier2) (occupied carrier2 s4)
   added: (box_at_loc box3 warehouse_loc) (free carrier2 s4)
   goals met: 11 of 13
98. (load_supply robot2 warehouse_loc box3 valve2)
   deleted: (box_empty box3) (supply_at_loc valve2 warehouse_loc)
   added: (supply_in_box valve2 box3) (box_full box3)
   goals met: 11 of 13
99. (load_carrier robot1 carrier1 box3 s3 warehouse_loc)
   deleted: (box_at_loc box3 warehouse_loc) (free carrier1 s3)
   added: (box_at_loc box3 carrier1) (occupied carrier1 s3)
   goals met: 11 of 13
100. (move_carrier robot1 carrier1 warehouse_loc location1)
   deleted: (robot_at_loc robot1 warehouse_loc)
   added: (robot_at_loc robot1 location1)
   goals met: 10 of 13
101. (unload_valve robot1 box1 valve3 location1 workstation1)
   deleted: (box_full box1) (supply_in_box valve3 box1) (supply_available valve3)
   added: (box_empty box1) (supply_at_loc valve3 location1) (has_valve workstation1)
   goals met: 11 of 13
102. (unload_carrier robot1 carrier1 box3 s3 location1)
   deleted: (box_at_loc box3 carrier1) (occupied carrier1 s3)
   added: (box_at_loc box3 location1) (free carrier1 s3)
   goals met: 11 of 13
103. (unload_valve robot1 box3 valve2 location1 workstation2)
   deleted: (box_full box3) (supply_in_box valve2 box3) (supply_available valve2)
   added: (box_empty box3) (supply_at_loc valve2 location1) (has_valve workstation2)
   goals met: 12 of 13
104. (move_carrier robot1 carrier1 location1 warehouse_loc)
   deleted: (robot_at_loc robot1 location1)
   added: (robot_at_loc robot1 warehouse_loc)
   goals met: 13 of 13
